package com.ldp.reader.model.bean;

import java.io.Serializable;

/**
 * Created by ldp on 17-5-10.
 * 书的章节链接(作为下载的进度数据)
 * 同时作为网络章节和本地章节 (没有找到更好分离两者的办法)
 */

public class BookChapterBeanByBiquge implements Serializable{
    private static final long serialVersionUID = 56423411356L;

    /**
     * status : 1
     * info : success
     * data : {"id":199175,"name":"大劫主","cid":1389236,"cname":"第六百八十五章 为一鸣惊人而来","pid":1389192,"nid":-1,"content":"\r\n　　 三天时间很快便到了，方原与九重天仙朝帝子，皆提前出了关，交出了自己推衍的排兵布阵之法，然后便在八荒城与仙盟长老的引领下，腾云往十大神关之一的镇魔神关而来！\r\n　　\r\n　　 镇关神关，便在八荒城之南十万里左右，与另外九大神关，一起死死的镇住了魔渊，仿佛钉子一般，这十关的排布，明显是有过上古高人的缜密推衍，每一个位置，皆很有讲究，而镇魔关，在这十大神关之中，也属于非常要紧的一处，距离魔渊极近，重要性不言自明。\r\n　　\r\n　　 因着这一次的较量，并未向外声张，所以方原与九重天皇朝太子，也皆未带太多人过来，只是身边几个追随者而已，甚至镇魔关军士，都不知道自己已经卷入了他们二人的较量。\r\n　　\r\n　　 他们是提前了大半夜出发，饶是如此，也飞掠了一个日夜的功夫，才赶到了八荒城左近。\r\n　　\r\n　　 这一路过来，只能见得遍地荒凉，几乎寸草不生，土壤都成为了黑红之色，十分的诡异，不过偶有一些地方，倒是会有惊人的灵气冲天而起，似乎有什么奇花异草生长，对此方原倒也不陌生，黑暗魔息所过之处，便会滋生出十分恐怖的黑暗魔物，但相应的，也会生长出许多的神株宝药，早在越国魔息湖时，他便已经知道这种黑暗魔息的特点了\u2026\u2026\r\n　　\r\n　　 因此，魔边向来都是一处又凶险，但又拥有众多资源的所在，其本身就算得上是一个宝藏，否则的话，纯靠四域的资源输送，也养活不起魔边这庞大的仙军与修行之人。\r\n　　\r\n　　 第四日清晨，第一缕曙光破出了地平线时，方原等人便已赶到了镇魔关附近，只见群山之间，孤峰林立，一座浩然雄关，坐镇中央，地跨三千里，内中保垒无数，大阵横空，自半空之中，搭眼看去，可以看到无数支仙军，自雄关四门之中出出入入，一身凶煞之气。\r\n　　\r\n　　 \u201c这么一座雄关，比九州一些古老世家的山门还要雄壮\u2026\u2026\u201d\r\n　　\r\n　　 方原这般看得一眼，也是心间一凛，倒是生出了些许的豪气。\r\n　　\r\n　　 \u201c若得此关镇守，在此斩妖除魔，魔砺道心热血，倒也不愧为一件美事！\u201d\r\n　　\r\n　　 心里安静的想着，只觉十分理所应当。\r\n　　\r\n　　 至于这一次的较量会不会输，他倒没有多作考虑。\r\n　　\r\n　　 这一次，自己本就不是为了赢下这场较量而来的，是为了一鸣惊人而来的。\r\n　　\r\n　　 \u201c\u2026\u2026\u201d\r\n　　\r\n　　 \u201c\u2026\u2026\u201d\r\n　　\r\n　　 \u201c呵呵，两位道子，这便是镇魔神关了，咱们下去吧！\u201d\r\n　　\r\n　　 八荒城长老笑着开口，率先引路，飞掠了下去。\r\n　　\r\n　　 方原与九重天仙朝道子，皆施展一缕清雾，遮住了自己的身形气机，跟随了八荒城长老下去，来到关前，那位八荒城长老便持贴叩开了关门，领着方原及一众人进入了关口。\r\n　　\r\n　　 镇魔关内，早有一位身材雄壮的白面玄甲神将来迎，他看到了跟随在八荒城长老身后的方原与九重天仙朝道子二人，皆以法术遮住了面容，倒也不以为异，毕竟十大神关，每逢遇到凶险时，常会有一些奇人异士前来相助，这些人脾气古怪，不愿露面，那也是有的。\r\n　　\r\n　　 \u201c古铁长老，一应事务，皆已安排妥当，半个时辰后，即可出兵！\u201d\r\n　　\r\n　　 那白面玄甲神将名唤凤离长，乃是一位元婴高阶修士，神婴修为，实力很是不俗，只是出身毕竟不好，据说是一位小世家出身，因此在这魔边征战若许年，也只是从一位小小校尉，一路积功而上，由赤甲神将，升为了金甲神将，然后便是玄甲神将，这却等于是到了头了，想要成为有资格身披紫甲，镇守一方神关的十大神将之一，那已经不是他能够上得去的。\r\n　　\r\n　　 而在这神关之中，此人的地位，却是不可动摇，乃是原来的镇魔关玄甲神将之首，而在方原与九重天仙朝太子赶来之前，便已经将他们的排兵阵卷通过传送秘法交了过来，如今已经安排妥当了，方原与九重天仙朝太子，也只是等着赶到了这里来亲眼看看而已。\r\n　　\r\n　　 这些神关将士，此前三次出兵绞杀那头夜魔，皆无功而返，反而被它吞噬了不少同僚，最后甚至害得老神将引咎卸任，心里都恨急了它，一听要出关绞杀这一头夜魔，却皆是激动异常，磨拳擦掌。\r\n　　\r\n　　 至于分成两队人马，争夺那夜魔首级之事，倒也没有起疑，魔边将士本来就经常相互较劲，争夺军功，彼引争着拿这一颗夜魔首级的事情，在他们看来是美事。\r\n　　\r\n　　 甚至他们自己，还赌斗了一坛烈酒，要分个高下。\r\n　　\r\n　　 \u201c那便好，老夫会在关上看着你们，将那妖魔首级取来，祭我魔边神将！\u201d\r\n　　\r\n　　 古铁长老沉声大喝，定下了此事。\r\n　　\r\n　　 当即带了方原与九重天太子来到了镇魔关城楼之上，往向看去，便见得关下如今早有千余将士分列两旁，左首的将士，头上系着金带，有七员玄甲神将，骑虎跨象，各率了一百亲兵，右首的将士，则是八位玄甲神将，头顶黑巾，也是各牵坐骑，皆率一百亲兵。\r\n　　\r\n　　 方原自城墙之上，向下瞧去，倒是微微皱眉。\r\n　　\r\n　　 金带玄甲，自然是九重天帝子一方人马，黑巾玄甲，则是自己一方，两人各有八位大将，只是如今出兵在即，为何九重天帝子一方，却只出来了七位神将，还有一位呢？\r\n　　\r\n　　 \u201c玩什么花样？\u201d\r\n　　\r\n　　 他看了九重天帝子一眼，微微皱眉，但也未曾问出口。\r\n　　\r\n　　 而那位九重天帝子，则也是静静立身于城墙之上，默不作声，亦看不表表情。\r\n　　\r\n　　 眼见得时辰已差不多了，那位古铁长老便向方原与九重天帝子低声道：\u201c两位道子，出兵之策，是你们二人定的，这些将士，也是你们自己选的，如今他们都已演练纯熟，即将出兵，待到结果出现之后，便希望你们二人可以遵守这个结果吧，休要再生事了\u2026\u2026\u201d\r\n　　\r\n　　 面对着这嘱咐，方原与九重天帝子，都只是轻轻摇头，也懒得多作回答。\r\n　　\r\n　　 而那古铁长老则转过身去，在城墙之上轻轻一拍，喝道：\u201c吾等魔边将士，洒热血，动刀松，只愿斩尽魔物，护我天元，今有魔物一只，便于神关三千里外作乱，吞我同僚，斩我将士，镇魔关内皆男儿，岂能容他猖獗，今日，便是吾等将士取其首级，平息祸乱之时！\u201d\r\n　　\r\n　　 下方将士，等候已久，闻言皆扬声大喝：\u201c斩妖魔，平祸乱！\u201d\r\n　　\r\n　　 古铁长老面露笑容，哈哈大笑，而后用力挥手：\u201c将士们，那就让老夫看看你们手段吧！\u201d\r\n　　\r\n　　 \u201c轰！\u201d\r\n　　\r\n　　 说着话时，周围一道金旗，一道黑旗，同时飞上了半空。\r\n　　\r\n　　 而在下方，那两方人马，也立时得令，大声呼喝，直轰隆隆向前冲了出去。\r\n　　\r\n　　 双方人马一动，则立时看出了区别来，金旗一方，七位玄甲神将，这一冲了出去，便是气势如龙，为首一人，骑着一头雄狮，手持银枪，奔腾如飞，后面两人，则一持剑，一持重锤，分别跨坐着神鹿与白马，后面则是四人，有人背长弓，有人持符篆，有人藏法宝。\r\n　　\r\n　　 观其阵势，正是破空七魁之阵，攻守有度，散而不乱，极为合宜。\r\n　　\r\n　　 而黑旗一方，那八位神将，却是稍显得别别扭扭，勉强成了一个圆，急急向前奔去，但因着有人快，有人慢，这个圆，却始终难以成圆，后面的人追，前面的人等，速度便一下子被耽误了，向前冲的势头显得有些慢，已渐渐被前方的金旗玄甲神将给甩下了一截子。\r\n　　\r\n　　 \u201c咦，这是什么鬼阵？\u201d\r\n　　\r\n　　 方原周围的人，都看得有些糊涂了起来。\r\n　　\r\n　　 场间众人，无一不是当世大修，修为精深，涉猎极广，对阵道研究不浅，这时候自然一眼便看出了金旗玄甲所施展的乃是破空七魁阵，十分适宜，可是看方原设下了阵法，却完全有些不明白了，居然不知道他摆的乃是什么阵，更不明白，赶路都麻烦，又如何杀敌？\r\n　　\r\n　　 当然了，场间人养气功夫都还是有的，便是心下狐疑，也只是交头结耳，低声议论，倒还不至于当面问出来，可是跟了方原来的两位老阵师却不管，直接就嘀咕了起来。\r\n　　\r\n　　 再等了片刻，只见那金旗玄甲已经足足与黑旗玄甲拉开了百多里的距离，黑旗玄甲一方还是阵不成阵，这城墙之上，那位来此观礼的飞流女将，也终于有些按捺不住了，转身向着方原道：\u201c你布置的究竟是什么阵法，这可是事关众将士性命，你当是在儿戏不成？\u201d\r\n　　\r\n　　 在旁边，九重天皇朝帝子身后，那一群老阵师里面，也有一人狐疑道：\u201c难道是故意消磨时间，等我们的军士先与魔物交上了手，然后你方甲士再赶到，坐守渔翁之利？\u201d\r\n　　\r\n　　 此言一出，周围顿时一片哗然，目光有些复杂的看了过来。\r\n　　\r\n　　 虽然坐守渔翁之利，是谁都希望的，可如今毕竟是两方道子之间，堂堂正正的赌斗，若真是用了这下作手段，那未免脸上也太难看了，堂堂圣地道子，真能丢得起这个人？\r\n　　\r\n　　 迎着这诸多议论，方原只作听不见，也懒得解释。\r\n　　\r\n　　 倒是两位老阵师听了，心下立时不满，岂能容得旁人笑话自家师弟？\r\n　　\r\n　　 刚刚还在腹诽方原布的是什么鬼阵的银发老阵师立时冷笑了一声，道：\u201c呵，真是一群不学无术之人，连我天枢门小师弟布的阵法都看不出来么，那分明就是一方\u2026\u2026啊\u2026\u2026\u201d\r\n　　\r\n　　 一时编不出来，推了黑发老阵师一把。\r\n　　\r\n　　 黑发老阵师急忙接了下去，冷哼一声，道：\u201c那个\u2026\u2026那个圆\u2026\u2026对了，是大圆若缺阵！\u201d\r\n　　\r\n　　 旁边人皆冷眼看着这两个只有筑基修为，架子却大到没谱的老疯子，都懒得搭理。\r\n　　\r\n　　 这时候，就连古铁长老都忍不住了，向方原揖礼道：\u201c方道子，此阵究竟\u2026\u2026\u201d\r\n　　\r\n　　 \u201c这么多人里，除了两位师兄，都无人识得我此阵之妙么？\u201d\r\n　　\r\n　　 方原目光扫了众修一眼，淡淡开口道：\u201c这就是\u2026\u2026大圆若缺阵！\u201d\r\n　　最快更新，无弹窗阅读请。\f\t\n","hasContent":1}
     */

    private int status;
    private String info;
    private DataBean data;

    public int getStatus() {
        return status;
    }

    public void setStatus(int status) {
        this.status = status;
    }

    public String getInfo() {
        return info;
    }

    public void setInfo(String info) {
        this.info = info;
    }

    public DataBean getData() {
        return data;
    }

    public void setData(DataBean data) {
        this.data = data;
    }

    public static class DataBean {
        /**
         * id : 199175
         * name : 大劫主
         * cid : 1389236
         * cname : 第六百八十五章 为一鸣惊人而来
         * pid : 1389192
         * nid : -1
         * content :
         　　 三天时间很快便到了，方原与九重天仙朝帝子，皆提前出了关，交出了自己推衍的排兵布阵之法，然后便在八荒城与仙盟长老的引领下，腾云往十大神关之一的镇魔神关而来！

         镇关神关，便在八荒城之南十万里左右，与另外九大神关，一起死死的镇住了魔渊，仿佛钉子一般，这十关的排布，明显是有过上古高人的缜密推衍，每一个位置，皆很有讲究，而镇魔关，在这十大神关之中，也属于非常要紧的一处，距离魔渊极近，重要性不言自明。

         因着这一次的较量，并未向外声张，所以方原与九重天皇朝太子，也皆未带太多人过来，只是身边几个追随者而已，甚至镇魔关军士，都不知道自己已经卷入了他们二人的较量。

         他们是提前了大半夜出发，饶是如此，也飞掠了一个日夜的功夫，才赶到了八荒城左近。

         这一路过来，只能见得遍地荒凉，几乎寸草不生，土壤都成为了黑红之色，十分的诡异，不过偶有一些地方，倒是会有惊人的灵气冲天而起，似乎有什么奇花异草生长，对此方原倒也不陌生，黑暗魔息所过之处，便会滋生出十分恐怖的黑暗魔物，但相应的，也会生长出许多的神株宝药，早在越国魔息湖时，他便已经知道这种黑暗魔息的特点了……

         因此，魔边向来都是一处又凶险，但又拥有众多资源的所在，其本身就算得上是一个宝藏，否则的话，纯靠四域的资源输送，也养活不起魔边这庞大的仙军与修行之人。

         第四日清晨，第一缕曙光破出了地平线时，方原等人便已赶到了镇魔关附近，只见群山之间，孤峰林立，一座浩然雄关，坐镇中央，地跨三千里，内中保垒无数，大阵横空，自半空之中，搭眼看去，可以看到无数支仙军，自雄关四门之中出出入入，一身凶煞之气。

         “这么一座雄关，比九州一些古老世家的山门还要雄壮……”

         方原这般看得一眼，也是心间一凛，倒是生出了些许的豪气。

         “若得此关镇守，在此斩妖除魔，魔砺道心热血，倒也不愧为一件美事！”

         心里安静的想着，只觉十分理所应当。

         至于这一次的较量会不会输，他倒没有多作考虑。

         这一次，自己本就不是为了赢下这场较量而来的，是为了一鸣惊人而来的。

         “……”

         “……”

         “呵呵，两位道子，这便是镇魔神关了，咱们下去吧！”

         八荒城长老笑着开口，率先引路，飞掠了下去。

         方原与九重天仙朝道子，皆施展一缕清雾，遮住了自己的身形气机，跟随了八荒城长老下去，来到关前，那位八荒城长老便持贴叩开了关门，领着方原及一众人进入了关口。

         镇魔关内，早有一位身材雄壮的白面玄甲神将来迎，他看到了跟随在八荒城长老身后的方原与九重天仙朝道子二人，皆以法术遮住了面容，倒也不以为异，毕竟十大神关，每逢遇到凶险时，常会有一些奇人异士前来相助，这些人脾气古怪，不愿露面，那也是有的。

         “古铁长老，一应事务，皆已安排妥当，半个时辰后，即可出兵！”

         那白面玄甲神将名唤凤离长，乃是一位元婴高阶修士，神婴修为，实力很是不俗，只是出身毕竟不好，据说是一位小世家出身，因此在这魔边征战若许年，也只是从一位小小校尉，一路积功而上，由赤甲神将，升为了金甲神将，然后便是玄甲神将，这却等于是到了头了，想要成为有资格身披紫甲，镇守一方神关的十大神将之一，那已经不是他能够上得去的。

         而在这神关之中，此人的地位，却是不可动摇，乃是原来的镇魔关玄甲神将之首，而在方原与九重天仙朝太子赶来之前，便已经将他们的排兵阵卷通过传送秘法交了过来，如今已经安排妥当了，方原与九重天仙朝太子，也只是等着赶到了这里来亲眼看看而已。

         这些神关将士，此前三次出兵绞杀那头夜魔，皆无功而返，反而被它吞噬了不少同僚，最后甚至害得老神将引咎卸任，心里都恨急了它，一听要出关绞杀这一头夜魔，却皆是激动异常，磨拳擦掌。

         至于分成两队人马，争夺那夜魔首级之事，倒也没有起疑，魔边将士本来就经常相互较劲，争夺军功，彼引争着拿这一颗夜魔首级的事情，在他们看来是美事。

         甚至他们自己，还赌斗了一坛烈酒，要分个高下。

         “那便好，老夫会在关上看着你们，将那妖魔首级取来，祭我魔边神将！”

         古铁长老沉声大喝，定下了此事。

         当即带了方原与九重天太子来到了镇魔关城楼之上，往向看去，便见得关下如今早有千余将士分列两旁，左首的将士，头上系着金带，有七员玄甲神将，骑虎跨象，各率了一百亲兵，右首的将士，则是八位玄甲神将，头顶黑巾，也是各牵坐骑，皆率一百亲兵。

         方原自城墙之上，向下瞧去，倒是微微皱眉。

         金带玄甲，自然是九重天帝子一方人马，黑巾玄甲，则是自己一方，两人各有八位大将，只是如今出兵在即，为何九重天帝子一方，却只出来了七位神将，还有一位呢？

         “玩什么花样？”

         他看了九重天帝子一眼，微微皱眉，但也未曾问出口。

         而那位九重天帝子，则也是静静立身于城墙之上，默不作声，亦看不表表情。

         眼见得时辰已差不多了，那位古铁长老便向方原与九重天帝子低声道：“两位道子，出兵之策，是你们二人定的，这些将士，也是你们自己选的，如今他们都已演练纯熟，即将出兵，待到结果出现之后，便希望你们二人可以遵守这个结果吧，休要再生事了……”

         面对着这嘱咐，方原与九重天帝子，都只是轻轻摇头，也懒得多作回答。

         而那古铁长老则转过身去，在城墙之上轻轻一拍，喝道：“吾等魔边将士，洒热血，动刀松，只愿斩尽魔物，护我天元，今有魔物一只，便于神关三千里外作乱，吞我同僚，斩我将士，镇魔关内皆男儿，岂能容他猖獗，今日，便是吾等将士取其首级，平息祸乱之时！”

         下方将士，等候已久，闻言皆扬声大喝：“斩妖魔，平祸乱！”

         古铁长老面露笑容，哈哈大笑，而后用力挥手：“将士们，那就让老夫看看你们手段吧！”

         “轰！”

         说着话时，周围一道金旗，一道黑旗，同时飞上了半空。

         而在下方，那两方人马，也立时得令，大声呼喝，直轰隆隆向前冲了出去。

         双方人马一动，则立时看出了区别来，金旗一方，七位玄甲神将，这一冲了出去，便是气势如龙，为首一人，骑着一头雄狮，手持银枪，奔腾如飞，后面两人，则一持剑，一持重锤，分别跨坐着神鹿与白马，后面则是四人，有人背长弓，有人持符篆，有人藏法宝。

         观其阵势，正是破空七魁之阵，攻守有度，散而不乱，极为合宜。

         而黑旗一方，那八位神将，却是稍显得别别扭扭，勉强成了一个圆，急急向前奔去，但因着有人快，有人慢，这个圆，却始终难以成圆，后面的人追，前面的人等，速度便一下子被耽误了，向前冲的势头显得有些慢，已渐渐被前方的金旗玄甲神将给甩下了一截子。

         “咦，这是什么鬼阵？”

         方原周围的人，都看得有些糊涂了起来。

         场间众人，无一不是当世大修，修为精深，涉猎极广，对阵道研究不浅，这时候自然一眼便看出了金旗玄甲所施展的乃是破空七魁阵，十分适宜，可是看方原设下了阵法，却完全有些不明白了，居然不知道他摆的乃是什么阵，更不明白，赶路都麻烦，又如何杀敌？

         当然了，场间人养气功夫都还是有的，便是心下狐疑，也只是交头结耳，低声议论，倒还不至于当面问出来，可是跟了方原来的两位老阵师却不管，直接就嘀咕了起来。

         再等了片刻，只见那金旗玄甲已经足足与黑旗玄甲拉开了百多里的距离，黑旗玄甲一方还是阵不成阵，这城墙之上，那位来此观礼的飞流女将，也终于有些按捺不住了，转身向着方原道：“你布置的究竟是什么阵法，这可是事关众将士性命，你当是在儿戏不成？”

         在旁边，九重天皇朝帝子身后，那一群老阵师里面，也有一人狐疑道：“难道是故意消磨时间，等我们的军士先与魔物交上了手，然后你方甲士再赶到，坐守渔翁之利？”

         此言一出，周围顿时一片哗然，目光有些复杂的看了过来。

         虽然坐守渔翁之利，是谁都希望的，可如今毕竟是两方道子之间，堂堂正正的赌斗，若真是用了这下作手段，那未免脸上也太难看了，堂堂圣地道子，真能丢得起这个人？

         迎着这诸多议论，方原只作听不见，也懒得解释。

         倒是两位老阵师听了，心下立时不满，岂能容得旁人笑话自家师弟？

         刚刚还在腹诽方原布的是什么鬼阵的银发老阵师立时冷笑了一声，道：“呵，真是一群不学无术之人，连我天枢门小师弟布的阵法都看不出来么，那分明就是一方……啊……”

         一时编不出来，推了黑发老阵师一把。

         黑发老阵师急忙接了下去，冷哼一声，道：“那个……那个圆……对了，是大圆若缺阵！”

         旁边人皆冷眼看着这两个只有筑基修为，架子却大到没谱的老疯子，都懒得搭理。

         这时候，就连古铁长老都忍不住了，向方原揖礼道：“方道子，此阵究竟……”

         “这么多人里，除了两位师兄，都无人识得我此阵之妙么？”

         方原目光扫了众修一眼，淡淡开口道：“这就是……大圆若缺阵！”
         　　最快更新，无弹窗阅读请。

         * hasContent : 1
         */

        private int id;
        private String name;
        private int cid;
        private String cname;
        private int pid;
        private int nid;
        private String content;
        private int hasContent;

        public int getId() {
            return id;
        }

        public void setId(int id) {
            this.id = id;
        }

        public String getName() {
            return name;
        }

        public void setName(String name) {
            this.name = name;
        }

        public int getCid() {
            return cid;
        }

        public void setCid(int cid) {
            this.cid = cid;
        }

        public String getCname() {
            return cname;
        }

        public void setCname(String cname) {
            this.cname = cname;
        }

        public int getPid() {
            return pid;
        }

        public void setPid(int pid) {
            this.pid = pid;
        }

        public int getNid() {
            return nid;
        }

        public void setNid(int nid) {
            this.nid = nid;
        }

        public String getContent() {
            return content;
        }

        public void setContent(String content) {
            this.content = content;
        }

        public int getHasContent() {
            return hasContent;
        }

        public void setHasContent(int hasContent) {
            this.hasContent = hasContent;
        }
    }
}